[{"title":"Python学习笔记(3)","date":"2021-05-16T01:07:46.000Z","path":"posts/a70f86a0.html","text":"由于多次保存之后都不知道为什么被清了。所以只剩下截图了。","tags":[{"name":"编程","slug":"编程","permalink":"https://nari2021.github.io/my-blog/tags/%E7%BC%96%E7%A8%8B/"},{"name":"Python","slug":"Python","permalink":"https://nari2021.github.io/my-blog/tags/Python/"},{"name":"学习笔记","slug":"学习笔记","permalink":"https://nari2021.github.io/my-blog/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}]},{"title":"吾輩は猫である","date":"2021-05-11T14:29:02.000Z","path":"posts/49c78c96.html","text":"抜粋","tags":[]},{"title":"Python学习笔记(2)","date":"2021-05-11T00:53:43.000Z","path":"posts/7fc5b99e.html","text":"Day2 and Day3 由于Day2的笔记没有保存丢失，只剩下截图了（ Day3 位运算打印结果为int类型 位取反会产生补码 由于去了毕业旅游，day4和day3并在一起。 if 语句不用加括号，要加冒号，用缩进表示包含。 随机数函数需要引入random包。 条件2 用elif。 if else的进阶用法 用pass表示语句，可以暂时不编程。 空字符串表示false，有内容为true while循环。也是用冒号。 for循环 起始，终止，跳。 range范围为[X,Y)。1-50和为 （1,51） for i in range(3) 用于密码错误尝试三次。 for i in range(n): else: while…else同理","tags":[{"name":"编程","slug":"编程","permalink":"https://nari2021.github.io/my-blog/tags/%E7%BC%96%E7%A8%8B/"},{"name":"Python","slug":"Python","permalink":"https://nari2021.github.io/my-blog/tags/Python/"},{"name":"学习笔记","slug":"学习笔记","permalink":"https://nari2021.github.io/my-blog/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}]},{"title":"走れメロス","date":"2021-05-10T13:08:38.000Z","path":"posts/5a1d991.html","text":"新出語彙 妹婿：いもうとむこ 賢臣：けんしん 捕縛：ほばく 威厳：いげん 磔（はりつけ）とは、罪人を板や柱などに縛りつけ、槍などを用いて殺す公開処刑の刑罰のこと。磔刑（たっけい） 嗄れる：しわがれる 声がかれる ほくそ笑（え）む とは、人に隠れて笑う、人に気づかれない程度に少し笑うという意味 縄を打つ：犯人を取り押さえて―・つ 車軸：しゃじく 佳い：よい めでたい という意味をもつ 御免蒙る（ごめんこうむる）：相手の許しを得て退出する。失礼する 南無三：南無三宝の略、また失敗した際に「しまった」といった感動詞として発する。 せせら笑う：ばかにして冷ややかに笑う。あざける 胴震い：どうぶるい 寒けや恐ろしさで全身がふるえること。 おりから：折から、折柄。 ちょうどその時。 巣食うとは。 「棲み着いている」ことを表す言葉です 反社会的組織などの一般的にあまり好まれない人たちに対して使うこともできます。 独りよがり：独り善がり、自分が良いを考えていることを、他人のことをこうりょせずに、押し通そうとすること。 やんぬるかな：已矣哉の訓読み。 今となってはどうしようもない。 擡げる：もたげる 「頭を―」（目立った存在となってくる意にも） 疾風：しっぷう、はやて（疾風 どよめく：音が響き渡る まっぱだ：真っ裸 マント：披风 御復習い 悪びれずに：自分の行いを悪いことだと思うそぶりを見せない様子。 召す：めす 祭壇：さいだん 宥める：なだめる 冷静 堪える：こらえる 鞭打つ：むちうつ 怯む：ひるむ ひるまない まどろむ：微睡む 抜粋","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://nari2021.github.io/my-blog/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"},{"name":"日本語","slug":"日本語","permalink":"https://nari2021.github.io/my-blog/tags/%E6%97%A5%E6%9C%AC%E8%AA%9E/"},{"name":"小説","slug":"小説","permalink":"https://nari2021.github.io/my-blog/tags/%E5%B0%8F%E8%AA%AC/"}]},{"title":"Python学习笔记（1）","date":"2021-05-10T02:18:05.000Z","path":"posts/db9be8e8.html","text":"1 使用单引号，双引号，三引号声明字符串，可以用于区分单双引号。 2 使用三引号输出的字符串可以保留格式输出。 3 Python中的布尔类型需要大写True False 4 重复声明中添加使用就不会警告。 5 输入数据用input（），builtins表示标准库内置函数。 6 input阻塞型函数，括号内输入提示内容。 7 使用变量存放接收到的内容 8 input接收到的数据都是string类型，无论输入的是数字还是文字。 9 不能直接使用接收到的数据进行加减需要进行类型转换。图中的+号被识别为了连接字符的符号。1000不是字符串无法连接。 10 使用和其他语言一样的类型转换int（）等。 11 注意以下区别 12 str转为int类型 前提是输入的数据没有小数。 13 True为1 False为0。 int类型转为bool。只有为0时才为False，负数正数都为True。变量为空字符串也为False。 14 print 逗号表示空格，在定义中，sep参数表示空格字符，可以设置，end属性也可以修改设置。 15 //表示整除，**表示次方。 2021.5.10 Day1","tags":[{"name":"编程","slug":"编程","permalink":"https://nari2021.github.io/my-blog/tags/%E7%BC%96%E7%A8%8B/"},{"name":"Python","slug":"Python","permalink":"https://nari2021.github.io/my-blog/tags/Python/"},{"name":"学习笔记","slug":"学习笔记","permalink":"https://nari2021.github.io/my-blog/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}]},{"title":"日本語の勉強——詩（1）","date":"2021-04-05T13:44:39.000Z","path":"posts/5701c8b1.html","text":"初恋..はじめに やさしく白き手をのべて 林檎をわれにあたへしは 薄紅の秋の実に 人こひ初めしはじめなり この一節に初めて触れたのは、国語便覧の近現代名詩選を読んでいる時でした。私は多感な心で時の流れも忘れて藤村さんの素敵な詩にひたっていました。 初恋 初恋 島崎 藤村 まだあげ初めし前髪の 林檎のもとに見えしとき 前にさしたる花櫛の 花ある君と思ひけり やさしく白き手をのべて 林檎をわれにあたへしは 薄紅の秋の実に 人こひ初めしはじめなり わがこゝろなきためいきの その髪の毛にかゝるとき たのしき恋の盃を 君が情けに酌みしかな 林檎畠の樹の下に おのづからなる細道は 誰がふみそめしかたみぞと 問ひたまふこそこひしけれ 人をよわせた五七調のリズムは甘美に響きます。この詩の言葉の意味が正確に理解できませんか。おそらく理解しないまま今まで口ずさんできたでしょうね。さぁ、一行ずつ言葉の意味の解説を試みをしてみましょう。 鑑賞 まだあげ初めし前髪の 訳：まだ結い上げたばかりのあなたの前髪。 「髪を結い上げる」とは、明治時代のころ、少女が12、3歳頃になると、「もう子供でもない、成人の女性になった」という変化を示す印である。 林檎のもとに見えしとき 訳：林檎の木の下に君の姿が見えた。 「見えし」とは、動詞の連用形に過去の助動詞「き」の連体形を接続するものです。「見えし」は「見えた」の意味です。 前にさしたる花櫛の 訳：前髪のさしている花櫛は。 「花櫛」とは、造花で飾った櫛、主に少女用。「さしたる」とは、「さす」の連用形「さし」に完了・存続の意味を持つ「たり」助動詞の連体形を接続するものです。 花ある君と思ひけり 訳：君が花のように美しいと思った。 「思ひけり」とは、「思ふ」の連用形「思ひ」に過去の助動詞「けり」の終止形を接続するものです。「思ひけり」は「思った」の意味です。 やさしく白き手をのべて 訳：あなたは、やさしく白い手をのばして。 「白き」とは、「白し」の連体形です。 林檎をわれにあたへしは 訳：私に林檎をくれました。 「われ」は「我」と書きます。「あたへし」とは、ハ行下二段活用の動詞「与ふ」の連用形「与へ」に「し」を接続するものです。現代語の「与える」とちょっと違いがあります。 薄紅の秋の実に 訳：（もらった林檎は）、薄紅の秋の実です。 人こひ初めしはじめなり 訳：わたしは、初めてあなたとの恋に落ちているですよ。 「こひ」とは、「恋」です。「なり」は古典にて用いられる判断を下す助動詞です。「なり」は「です」の意味です。 わたしたちも思う人から贈り物をもらった時、その贈り物を本人の化身のように思って大切にしているでしょう。少年は、少女をくれた林檎を、少女であるかのように恋心を抱いています。 わがこゝろなきためいきの 訳：わたしがおもわずため息をもらした。 「こころなき」とは、「おもわず」の意味です。無意識に、あるいは知らず知らずのうちに。 その髪の毛にかゝるとき 訳：あなたの髪の毛にかかっている時。 たのしき恋の盃を 訳：楽しい恋の盃を。 「たのしき」とは、「楽し」の連体形です。 君が情けに酌みしかな 訳：わたしは、恋の盃を君と情け深いに酌みかわしているかな。 この句は譬えです。盃から「酌みし」という言葉が導かれています。 林檎畠の樹の下に 訳：林檎畠の樹の下に。 おのづからなる細道は 訳：（わたしたちがここに通って歩き踏み固めた）おのずからなる細道は。 林檎畠に自然にできた細道は、少年と少女は、いつも同じ道を通い、数え切れないほど会っているのでしょう。 誰がふみそめしかたみぞと 訳：「誰がこの道を踏み固めたのでしょう」と。 問ひたまふこそこひしけれ 訳：あなたは（「誰がこの道を踏み固めたのでしょう」と）尋ねる、いと愛おしく思うのです。 「あのね、林檎の中にこの細く続いてる道は、誰が作ったのかな」ーー少女が少年に訪ねます。少年は彼女を愛おしく思うのですよね。 後書き出典・引用・参考文献： [1]若菜集 [2]総合国語便覧 [3]Yahoo！知恵袋 [4]ジャパンウィキペディア","tags":[{"name":"日本語","slug":"日本語","permalink":"https://nari2021.github.io/my-blog/tags/%E6%97%A5%E6%9C%AC%E8%AA%9E/"},{"name":"詩","slug":"詩","permalink":"https://nari2021.github.io/my-blog/tags/%E8%A9%A9/"},{"name":"鑑賞","slug":"鑑賞","permalink":"https://nari2021.github.io/my-blog/tags/%E9%91%91%E8%B3%9E/"}]},{"title":"开发日志1.1","date":"2021-02-19T08:11:40.000Z","path":"posts/a292b236.html","text":"开发日志1.1修复了如下bug 贴图不正确现在赞赏码可以正确显示了（再也不是别人的了 评论功能取消了原有的disqus，改为使用valine插件。现在评论可以不需要使用小飞机了。 左侧菜单修复了bulletin board不能正确指向url地址。现在可以正确指向categories属性为开发日志的文章了。但是这样会导致两个标签同时被选中，所以我决定暂时移除此功能，会在后续版本中改进。 摘要修复了原本文章摘要会弹出meting等代码的乱码，现在可以正确显示了。 路径改变由原本指向nari2021.github.io，即使用的仓库名是nari2021.github.io改为了my-blog。此操作需要在多处配置文件里面进行修改，是个雷区。 后续改进方向添加音乐功能，友链，图片大小设置，各处文章的超链接进行衔接（后续可能会更新连载系列的文，涉及到目录等功能会考虑使用Python等语言进行一键操作，待学习），使用手机等快速发博客功能，而不是在电脑使用typora编辑markdown文件还要考虑语法，主页的背景设置，转场设置等功能。 因为indigo这个模板主题有很多功能没有包含进来，后续的开发可能会遇到很多问题，敬请期待。 非常感谢你能读到这里！！","tags":[{"name":"开发日志","slug":"开发日志","permalink":"https://nari2021.github.io/my-blog/tags/%E5%BC%80%E5%8F%91%E6%97%A5%E5%BF%97/"}]},{"title":"开发日志1.0","date":"2021-02-18T13:00:13.000Z","path":"posts/d59582a0.html","text":"开发日志1.0历经数小时，经过不断地尝试和实践，终于让这个博客有了自己的雏形，以下记录的是该博客已经实现好的功能和实现过程中的雷区。 博客的搭建主要参考教程是bilibili一个up主的视频(单击此处即可进入)。 博客选择部署在GitHub上面，gitee也可以，而且访问速度会比GitHub快很多，当完成了以上步骤就可以进行主题等操作。 主题的设置本博客采用的主题是indigo主题，在GitHub上可以进行下载。并且按照教程进行安装即可，网上的配置方式很多，可以采用 1npm install hexo-xxx 上面这个命令格式安装自己想要的插件，比如音乐播放，live2d等。具体可以参考这篇文章，里面有一些比较常用的插件。 如果按照上诉步骤弄完，主要是主题的切换，将根目录下的_config.yml 文件中 123 theme: landscapechange to theme: xxxx 然后在根目录下执行启动命令报错的话。 1hexo s 因为我遇到了这样的坑，且indigo主题的作者已经不再维护这个项目了。在GitHub的issue里面可以看到类似的问题出现，根据描述疑似是win10的个例会掉坑。最后我找到的解决方案是，直接把别人的代码拷贝下来修改yml文件的配置即可。（因为咱也不是很懂具体的内部原理 实现的一些功能包含了博客基本的功能。 个人主页 ↑这就是大概实现的一个雏形啦~ 里面的文章是测试用的文章。具体的一些小功能例如页面的自动收缩，就不详细说了，具体参照indigo的yml文件说明文档。 左侧的菜单栏介绍从上往下分别就是 主页这个就不用多说了吧！ Archives这个的功能是按照日期查看我的博客。 Tags这个的功能是按照标签对博客进行筛选。以后我写的文章里面都会认真进行分类的！ Categories这个的功能是按照分类对博客进行筛选。比如学习类，编程类，生活类。 bulletin board这个就是公告栏啦。原计划是定向到 source/categories/..目标文件夹下面的一个分类，这样点击这个菜单选项就可以直接定向到有关于开发日志和公告类的博客了。（但是目前好像出了的差错，计划在后续过程中修复 GitHub点击后会跳转到我部署在GitHub上的代码链接。 Twitter什么？你想点进来？你不对劲。目前不开放此功能！ 一些小功能评论系统使用的是框架自带的disqus。配置很简单只需要将其属性改成true即可。但是缺点也很明显，首先加载速度很慢，可能需要小飞机的支持。 如图所示。在文章最底下，可能需要等待一段时间加载。如果加载不出来，点击Reload稍等即可。 该插件是第三方的应用，所以需要Google/FB/小蓝鸟等账号的登录，需要小飞机。 评论之后的结果就会像下图一样。 打赏功能如果觉得对你有帮助的话！！！！！！！！！看到文末的小圆圈了吗（ 琐碎功能包含了访客数统计(修改配置文件)，目录导航，文章分享，站内搜索，单篇文章访问数量等功能。 我学到了什么引用一句谚语：石の上にも三年。有志者事竟成。 在教程的帮助下，虽然可以很快的以一种很简单的方式，跳过了其原理搭建出一个自己的blog，不过在此期间是有很多不通顺的地方的。正是这些地方能学习到很多东西，比如markdown文件的语法，yml文件的语法，html文件的语法，各项配置，导入，部署。只有真正做过一次才能体会到最后成功的喜悦。 最后这算是我的第一篇文章，可能会有很多没做好的地方。会在未来很长的一段时间内，不断地学习相关知识并优化该网站。 文章的数量应该也会随着时间慢慢堆积。我会在这里存放我的学习、生活、社交、对事物的思考以及一些琐碎的文章，有助于未来的我，在回首今天写下这第一篇文章时，不忘当初的初心。 非常感谢你能够阅读到这里！！！！！","tags":[{"name":"开发日志","slug":"开发日志","permalink":"https://nari2021.github.io/my-blog/tags/%E5%BC%80%E5%8F%91%E6%97%A5%E5%BF%97/"}]}]